ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
void setUp(void) {
    printf_dma_flush();
}

void tearDown(void) {
    printf_dma_flush();
}

/* ====================================================================
 * RCC clock frequency tests
 * ==================================================================== */

/*
 * These tests verify the clock tree configured by SystemInit() at
 * startup: 100 MHz SYSCLK from HSI via PLL, APB1 /2 → 50 MHz,
 * APB2 /1 → 100 MHz, APB1 timer clock = APB1 × 2 = 100 MHz.
 */

void test_rcc_sysclk_is_100mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_sysclk());
}

void test_rcc_apb1_clk_is_50mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(50000000U, rcc_get_apb1_clk());
}

void test_rcc_apb2_clk_is_100mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_apb2_clk());
}

void test_rcc_apb1_timer_clk_is_100mhz(void)
{
    /* APB1 prescaler = /2 → timer clock = APB1 × 2 per STM32 clock tree */
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_apb1_timer_clk());
}

/* ====================================================================
 * Timer hardware tests
 * ==================================================================== */

/*
 * Measure timer_delay_us(1000) against the DWT cycle counter.
 *
 * At 100 MHz, 1000 µs = 100 000 cycles. We allow ±2000 cycles (±20 µs)
 * to accommodate DWT read overhead and minor timer startup latency.
 */
#define DELAY_TEST_US           1000U
#define DELAY_EXPECTED_CYCLES   (DELAY_TEST_US * 100U)  /* 100 000 at 100 MHz */
#define DELAY_TOLERANCE_CYCLES  2000U

void test_timer_delay_us_accuracy(void)
{
    /* Enable DWT cycle counter (same pattern as spi_perf.c) */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    uint32_t start = DWT->CYCCNT;
    timer_delay_us(DELAY_TEST_US);
    uint32_t elapsed = DWT->CYCCNT - start;

    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        DELAY_TOLERANCE_CYCLES,
        DELAY_EXPECTED_CYCLES,
        elapsed,
        "timer_delay_us(1000) not within ±20 us of 1 ms");
}

/* ====================================================================
 * Non-SPI hardware tests
 * ==================================================================== */

void test_fpu_multiplication(void) {
    volatile float a = 3.14f;
    volatile float b = 2.72f;
    volatile float result = a * b;
    TEST_ASSERT_FLOAT_WITHIN_MESSAGE(0.01f, 8.54f, result,
                                     "FPU multiplication incorrect");
}

void test_fpu_division(void) {
    volatile float a = 10.0f;
    volatile float b = 4.0f;
    volatile float result = a / b;
    TEST_ASSERT_FLOAT_WITHIN_MESSAGE(0.001f, 2.5f, result,
                                     "FPU division incorrect");
}

/* ====================================================================
 * USART1 loopback tests (PA9=TX/AF7, PB7=RX/AF7)
 * ==================================================================== */

void test_usart1_loopback_0xa5(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0xA5);
}

void test_usart1_loopback_0x00(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0x00);
}

void test_usart1_loopback_0xff(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0xFF);
}

void test_usart1_loopback_sequence(void)
{
    uart_lb_init_usart1();
    /* Walking-bit and alternating patterns */
    static const uint8_t seq[] = { 0xAA, 0x55, 0x01, 0x02, 0x04, 0x08,
                                   0x10, 0x20, 0x40, 0x80, 0x12, 0x34 };
    for (uint32_t i = 0; i < sizeof(seq); i++) {
        uart_lb_check(USART1, seq[i]);
    }
}

/* ====================================================================
 * USART6 loopback tests (PC6=TX/AF8, PC7=RX/AF8)
 * ==================================================================== */

void test_usart6_loopback_0xa5(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0xA5);
}

void test_usart6_loopback_0x00(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0x00);
}

void test_usart6_loopback_0xff(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0xFF);
}

void test_usart6_loopback_sequence(void)
{
    uart_lb_init_usart6();
    static const uint8_t seq[] = { 0xAA, 0x55, 0x01, 0x02, 0x04, 0x08,
                                   0x10, 0x20, 0x40, 0x80, 0x12, 0x34 };
    for (uint32_t i = 0; i < sizeof(seq); i++) {
        uart_lb_check(USART6, seq[i]);
    }
}

/* ====================================================================
 * GPIO output/input loopback test helpers
 *
 * Loopback wiring (same jumper cables used for UART loopback tests):
 *   PA9 (output) <-> PB7 (input)   — UART1 cable
 *   PC6 (output) <-> PC7 (input)   — UART6 cable
 *
 * Each test reconfigures the pins as plain push-pull GPIO output and
 * floating input, drives the output, and reads back the input.  Pins
 * are cleaned up (re-set to analog/hi-Z) after each test so they do
 * not interfere with the UART loopback tests that follow.
 * ==================================================================== */

/* Short busy-wait: ~10 µs at 100 MHz — allows the signal to propagate
 * through the loopback cable before we sample the input pin.           */
#define GPIO_LB_SETTLE_CYCLES  1000U

static void gpio_lb_settle(void)
{
    volatile uint32_t n = GPIO_LB_SETTLE_CYCLES;
    while (n--) { /* spin */ }
}

/**
 * @brief Configure the PA9/PB7 loopback pair as plain GPIO output/input.
 *
 * PA9 — push-pull output, no pull
 * PB7 — floating input, no pull
 */
static void gpio_lb_init_pa9_pb7(void)
{
    gpio_clock_enable(GPIO_PORT_A);
    gpio_clock_enable(GPIO_PORT_B);

    gpio_configure_full(GPIO_PORT_A, 9,
                        GPIO_MODE_OUTPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_FAST, GPIO_PULL_NONE);

    gpio_configure_full(GPIO_PORT_B, 7,
                        GPIO_MODE_INPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_LOW, GPIO_PULL_NONE);
}

/**
 * @brief Release the PA9/PB7 pair back to analog (hi-Z).
 * Called after each GPIO test so UART tests on the same pins work.
 */
static void gpio_lb_deinit_pa9_pb7(void)
{
    gpio_configure_pin(GPIO_PORT_A, 9, GPIO_MODE_ANALOG);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);
}

/**
 * @brief Configure the PC6/PC7 loopback pair as plain GPIO output/input.
 *
 * PC6 — push-pull output, no pull
 * PC7 — floating input, no pull
 */
static void gpio_lb_init_pc6_pc7(void)
{
    gpio_clock_enable(GPIO_PORT_C);

    gpio_configure_full(GPIO_PORT_C, 6,
                        GPIO_MODE_OUTPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_FAST, GPIO_PULL_NONE);

    gpio_configure_full(GPIO_PORT_C, 7,
                        GPIO_MODE_INPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_LOW, GPIO_PULL_NONE);
}

/**
 * @brief Release the PC6/PC7 pair back to analog (hi-Z).
 */
static void gpio_lb_deinit_pc6_pc7(void)
{
    gpio_configure_pin(GPIO_PORT_C, 6, GPIO_MODE_ANALOG);
    gpio_configure_pin(GPIO_PORT_C, 7, GPIO_MODE_ANALOG);
}

/* ====================================================================
 * GPIO loopback tests — PA9 output / PB7 input
 * ==================================================================== */

void test_gpio_pa9_high_reads_pb7_high(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_set_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    uint8_t level = gpio_read_pin(GPIO_PORT_B, 7);
    gpio_lb_deinit_pa9_pb7();
    TEST_ASSERT_EQUAL_MESSAGE(1, level,
        "PA9=HIGH should read PB7=HIGH — check jumper PA9<->PB7");
}

void test_gpio_pa9_low_reads_pb7_low(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    uint8_t level = gpio_read_pin(GPIO_PORT_B, 7);
    gpio_lb_deinit_pa9_pb7();
    TEST_ASSERT_EQUAL_MESSAGE(0, level,
        "PA9=LOW should read PB7=LOW — check jumper PA9<->PB7");
}

void test_gpio_pa9_toggle_reads_back(void)
{
    gpio_lb_init_pa9_pb7();

    /* Start LOW */
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 start LOW: PB7 should be LOW");

    /* Toggle to HIGH */
    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after toggle: PB7 should be HIGH");

    /* Toggle back to LOW */
    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after second toggle: PB7 should be LOW");

