ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
    gpio_lb_deinit_pa9_pb7();
}

/* ====================================================================
 * GPIO loopback tests — PC6 output / PC7 input
 * ==================================================================== */

void test_gpio_pc6_high_reads_pc7_high(void)
{
    gpio_lb_init_pc6_pc7();
    gpio_set_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    uint8_t level = gpio_read_pin(GPIO_PORT_C, 7);
    gpio_lb_deinit_pc6_pc7();
    TEST_ASSERT_EQUAL_MESSAGE(1, level,
        "PC6=HIGH should read PC7=HIGH — check jumper PC6<->PC7");
}

void test_gpio_pc6_low_reads_pc7_low(void)
{
    gpio_lb_init_pc6_pc7();
    gpio_clear_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    uint8_t level = gpio_read_pin(GPIO_PORT_C, 7);
    gpio_lb_deinit_pc6_pc7();
    TEST_ASSERT_EQUAL_MESSAGE(0, level,
        "PC6=LOW should read PC7=LOW — check jumper PC6<->PC7");
}

/* ====================================================================
 * EXTI interrupt tests — PA9 output triggers EXTI line 7 (port B, PB7)
 *
 * Strategy: use EXTI_MODE_INTERRUPT so that EXTI->PR is set on each
 * detected edge (the pending register is only updated in interrupt mode).
 * A minimal EXTI9_5_IRQHandler defined here overrides the Default_Handler
 * (infinite loop) weak alias: it increments a volatile counter and clears
 * the pending bit, then returns — allowing the test to observe how many
 * times the handler fired.
 *
 * Timeout guard: spin up to ~1 ms (100 000 cycles at 100 MHz) before
 * declaring a failure — long enough for any reasonable signal path but
 * short enough to avoid a multi-second hang on a disconnected jumper.
 * ==================================================================== */

/* Shared ISR counter — incremented by EXTI9_5_IRQHandler on each fire */
static volatile uint32_t g_exti9_5_count = 0;

/**
 * @brief Minimal EXTI9_5 handler: count the interrupt and clear pending.
 *
 * Overrides the Default_Handler weak alias in startup code.
 * Clears only line 7 (PB7) pending bit; other lines in the [5-9] group
 * are left untouched (none are armed in these tests).
 */
void EXTI9_5_IRQHandler(void)
{
    if (EXTI->PR & (1U << 7)) {
        EXTI->PR = (1U << 7);   /* write 1 to clear */
        g_exti9_5_count++;
    }
}

#define EXTI_LB_TIMEOUT_CYCLES  100000U

/**
 * @brief Spin until g_exti9_5_count exceeds prev_count, or timeout.
 * @return 1 if count increased, 0 on timeout.
 */
static int exti_lb_wait_count(uint32_t prev_count)
{
    uint32_t n = EXTI_LB_TIMEOUT_CYCLES;
    while (n--) {
        if (g_exti9_5_count != prev_count) return 1;
    }
    return 0;
}

void test_exti_rising_edge_pb7(void)
{
    /* PA9 = output (drive signal), PB7 = input (EXTI line 7 port B) */
    gpio_lb_init_pa9_pb7();

    /* Drive output LOW before arming the edge detector */
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, RISING) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Trigger: drive PA9 HIGH (rising edge on PB7) */
    gpio_set_pin(GPIO_PORT_A, 9);

    /* Observe: ISR should fire and increment the counter */
    int fired = exti_lb_wait_count(prev);

    /* Cleanup */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired,
        "EXTI line 7 rising edge did not fire — check jumper PA9<->PB7");
}

void test_exti_falling_edge_pb7(void)
{
    /* Start with PA9 HIGH so a falling edge can be generated */
    gpio_lb_init_pa9_pb7();
    gpio_set_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_FALLING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, FALLING) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Drive PA9 LOW → falling edge on PB7 */
    gpio_clear_pin(GPIO_PORT_A, 9);

    int fired = exti_lb_wait_count(prev);

    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired,
        "EXTI line 7 falling edge did not fire — check jumper PA9<->PB7");
}

void test_exti_both_edges_pb7(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_BOTH,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, BOTH) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Rising edge */
    gpio_set_pin(GPIO_PORT_A, 9);
    int fired_rising = exti_lb_wait_count(prev);
    prev = g_exti9_5_count;

    /* Falling edge */
    gpio_clear_pin(GPIO_PORT_A, 9);
    int fired_falling = exti_lb_wait_count(prev);

    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired_rising,
        "EXTI BOTH: rising edge did not fire — check jumper PA9<->PB7");
    TEST_ASSERT_MESSAGE(fired_falling,
        "EXTI BOTH: falling edge did not fire — check jumper PA9<->PB7");
}

void test_exti_software_trigger_pb7(void)
{
    /* Software trigger: no loopback cable required.
     * Writes to EXTI->SWIER to generate a synthetic rising edge.
     * The EXTI9_5_IRQHandler defined above will fire and increment
     * g_exti9_5_count, confirming end-to-end EXTI machinery works.  */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);

    /* Enable SYSCFG clock (needed by exti_configure_gpio_interrupt) */
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    /* Configure for rising edge, interrupt mode */
    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt for software trigger test failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Fire software trigger */
    int sw_ret = exti_software_trigger(7);
    TEST_ASSERT_EQUAL_MESSAGE(0, sw_ret,
        "exti_software_trigger(7) returned error");

