ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
    RUN_TEST(test_usart1_loopback_0xa5);
    RUN_TEST(test_usart1_loopback_0x00);
    RUN_TEST(test_usart1_loopback_0xff);
    RUN_TEST(test_usart1_loopback_sequence);

    printf("\n--- Tier 5: USART6 loopback (PC6/PC7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_usart6_loopback_0xa5);
    RUN_TEST(test_usart6_loopback_0x00);
    RUN_TEST(test_usart6_loopback_0xff);
    RUN_TEST(test_usart6_loopback_sequence);

    /* ----------------------------------------------------------
     * Tier 5: GPIO output/input loopback tests
     *   PA9 (output) wired to PB7 (input) — UART1 loopback cable
     *   PC6 (output) wired to PC7 (input) — UART6 loopback cable
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: GPIO loopback (PA9/PB7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_gpio_pa9_high_reads_pb7_high);
    RUN_TEST(test_gpio_pa9_low_reads_pb7_low);
    RUN_TEST(test_gpio_pa9_toggle_reads_back);

    printf("\n--- Tier 5: GPIO loopback (PC6/PC7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_gpio_pc6_high_reads_pc7_high);
    RUN_TEST(test_gpio_pc6_low_reads_pc7_low);

    /* ----------------------------------------------------------
     * Tier 5: EXTI interrupt tests
     *   PA9 (output) wired to PB7 (input, EXTI line 7 port B)
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: EXTI loopback (PA9->PB7, line 7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_exti_rising_edge_pb7);
    RUN_TEST(test_exti_falling_edge_pb7);
    RUN_TEST(test_exti_both_edges_pb7);
    RUN_TEST(test_exti_software_trigger_pb7);

    printf_dma_flush();
    return UNITY_END();
}

#endif /* HIL_TEST_MODE */
